import logging #Подключение модуля для логирования

logging.basicConfig(
    filename="cou_cap.log",
    level=logging.INFO,
    format="%(asctime)s - [%(levelname)s] - %(app)s - %(name)s - (%(filename)s).%(funcName)s(%(lineno)d) - %(message)s",)
logger = logging.getLogger("LOGGER")
logger = logging.LoggerAdapter(logger, {"app": "тестовое приложение"})
logger.info('Программа запустилась.')
#Создаём список стран со столицами
list = {"Россия":"Москва","Греция":"Афины","Казахстан":"Астана","Китай":"Пекин","Великобритания":"Лондон",
"США":"Вашингтон","Франция":"Париж","Канада":"Оттава","Япония":"Токио","Бразилия":"Бразилиа",
"Москва":"Россия","Афины":"Греция","Астана":"Казахстан","Пекин":"Китай","Лондон":"Великобритания",
"Вашингтон":"США","Париж":"Франция","Оттава":"Канада","Токио":"Япония","Бразилиа":"Бразилия"}
logger.info('Создан словарь с названиями государств и их столицами.')

#Проверяем объект на его наличие в списке
while True:
    try:
        cou_cap = input("Введите страну или столицу из списка: ")
        logger.info(f'Пользователь ввел {cou_cap}')
        assert cou_cap in list
        logger.info('Проверка ввода.')
        break
    except AssertionError:
        print('Такой страны или столицы нет в списке.')
        logger.error('Страна или столица отсутствует в словаре.')

#Выводим объект
print(list[cou_cap])
logger.info('Программа завершена.')